#### Terraform Format and Style ``
#### Terraform Initialization `success`
#### Terraform Validation `success`
#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```

terraform
module.lambda_start_ec2.data.archive_file.lambda_zip: Reading...
module.lambda_stop_ec2.data.archive_file.lambda_zip: Reading...
module.lambda_start_ec2.data.archive_file.lambda_zip: Read complete after 0s [id=a98906208fe156812833341305ef83a4e1ed7fef]
module.lambda_stop_ec2.data.archive_file.lambda_zip: Read complete after 0s [id=ea88f891e5a64006cff90bdde537708676f5b6ae]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.cloudwatch_start_schedule.aws_cloudwatch_event_rule.schedule will be created
  + resource "aws_cloudwatch_event_rule" "schedule" {
      + arn                 = (known after apply)
      + description         = "Triggers the Lambda function to start EC2 instances at 8:00 AM on weekdays"
      + event_bus_name      = "default"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "ec2-scheduler-start-instances-schedule"
      + name_prefix         = (known after apply)
      + schedule_expression = "cron(0 8 ? * MON-FRI *)"
      + tags                = {
          + "CostCenter" = "IT"
          + "Owner"      = "Operations"
        }
      + tags_all            = {
          + "CostCenter"  = "IT"
          + "CreatedBy"   = "EC2-Scheduler"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "Operations"
          + "Project"     = "ec2-scheduler"
        }
    }

  # module.cloudwatch_start_schedule.aws_cloudwatch_event_target.lambda_target will be created
  + resource "aws_cloudwatch_event_target" "lambda_target" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + rule           = "ec2-scheduler-start-instances-schedule"
      + target_id      = "InvokeLambda"
    }

  # module.cloudwatch_start_schedule.aws_lambda_permission.allow_cloudwatch will be created
  + resource "aws_lambda_permission" "allow_cloudwatch" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "ec2-scheduler-start-ec2-instances"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromCloudWatch"
      + statement_id_prefix = (known after apply)
    }

  # module.cloudwatch_stop_schedule.aws_cloudwatch_event_rule.schedule will be created
  + resource "aws_cloudwatch_event_rule" "schedule" {
      + arn                 = (known after apply)
      + description         = "Triggers the Lambda function to stop EC2 instances at 5:00 PM on weekdays"
      + event_bus_name      = "default"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "ec2-scheduler-stop-instances-schedule"
      + name_prefix         = (known after apply)
      + schedule_expression = "cron(0 17 ? * MON-FRI *)"
      + tags                = {
          + "CostCenter" = "IT"
          + "Owner"      = "Operations"
        }
      + tags_all            = {
          + "CostCenter"  = "IT"
          + "CreatedBy"   = "EC2-Scheduler"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "Operations"
          + "Project"     = "ec2-scheduler"
        }
    }

  # module.cloudwatch_stop_schedule.aws_cloudwatch_event_target.lambda_target will be created
  + resource "aws_cloudwatch_event_target" "lambda_target" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + rule           = "ec2-scheduler-stop-instances-schedule"
      + target_id      = "InvokeLambda"
    }

  # module.cloudwatch_stop_schedule.aws_lambda_permission.allow_cloudwatch will be created
  + resource "aws_lambda_permission" "allow_cloudwatch" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "ec2-scheduler-stop-ec2-instances"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromCloudWatch"
      + statement_id_prefix = (known after apply)
    }

  # module.lambda_start_ec2.aws_cloudwatch_log_group.lambda_log_group will be created
  + resource "aws_cloudwatch_log_group" "lambda_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/ec2-scheduler-start-ec2-instances"
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags              = {
          + "CostCenter" = "IT"
          + "Owner"      = "Operations"
        }
      + tags_all          = {
          + "CostCenter"  = "IT"
          + "CreatedBy"   = "EC2-Scheduler"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "Operations"
          + "Project"     = "ec2-scheduler"
        }
    }

  # module.lambda_start_ec2.aws_iam_policy.lambda_policy will be created
  + resource "aws_iam_policy" "lambda_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy for ec2-scheduler-start-ec2-instances Lambda function"
      + id               = (known after apply)
      + name             = "ec2-scheduler-start-ec2-instances-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:DescribeInstances",
                          + "ec2:StartInstances",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "CreatedBy"   = "EC2-Scheduler"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "ec2-scheduler"
        }
    }

  # module.lambda_start_ec2.aws_iam_role.lambda_role will be created
  + resource "aws_iam_role" "lambda_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ec2-scheduler-start-ec2-instances-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCenter" = "IT"
          + "Owner"      = "Operations"
        }
      + tags_all              = {
          + "CostCenter"  = "IT"
          + "CreatedBy"   = "EC2-Scheduler"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "Operations"
          + "Project"     = "ec2-scheduler"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.lambda_start_ec2.aws_iam_role_policy_attachment.lambda_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "lambda_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "ec2-scheduler-start-ec2-instances-role"
    }

  # module.lambda_start_ec2.aws_lambda_function.function will be created
  + resource "aws_lambda_function" "function" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Lambda function to start EC2 instances during working hours"
      + filename                       = "modules/lambda/lambda_function.zip"
      + function_name                  = "ec2-scheduler-start-ec2-instances"
      + handler                        = "start_instances.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.10"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "2B8fs+J6ohmpdj+DwEF0SYjMVKKAxcSC0XSPPE58QN4="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCenter" = "IT"
          + "Owner"      = "Operations"
        }
      + tags_all                       = {
          + "CostCenter"  = "IT"
          + "CreatedBy"   = "EC2-Scheduler"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "Operations"
          + "Project"     = "ec2-scheduler"
        }
      + timeout                        = 60
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "REGION"    = "ap-south-1"
              + "TAG_KEY"   = "demo-key"
              + "TAG_VALUE" = "true"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.lambda_stop_ec2.aws_cloudwatch_log_group.lambda_log_group will be created
  + resource "aws_cloudwatch_log_group" "lambda_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/ec2-scheduler-stop-ec2-instances"
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags              = {
          + "CostCenter" = "IT"
          + "Owner"      = "Operations"
        }
      + tags_all          = {
          + "CostCenter"  = "IT"
          + "CreatedBy"   = "EC2-Scheduler"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "Operations"
          + "Project"     = "ec2-scheduler"
        }
    }

  # module.lambda_stop_ec2.aws_iam_policy.lambda_policy will be created
  + resource "aws_iam_policy" "lambda_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy for ec2-scheduler-stop-ec2-instances Lambda function"
      + id               = (known after apply)
      + name             = "ec2-scheduler-stop-ec2-instances-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:DescribeInstances",
                          + "ec2:StopInstances",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "CreatedBy"   = "EC2-Scheduler"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "ec2-scheduler"
        }
    }

  # module.lambda_stop_ec2.aws_iam_role.lambda_role will be created
  + resource "aws_iam_role" "lambda_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ec2-scheduler-stop-ec2-instances-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCenter" = "IT"
          + "Owner"      = "Operations"
        }
      + tags_all              = {
          + "CostCenter"  = "IT"
          + "CreatedBy"   = "EC2-Scheduler"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "Operations"
          + "Project"     = "ec2-scheduler"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.lambda_stop_ec2.aws_iam_role_policy_attachment.lambda_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "lambda_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "ec2-scheduler-stop-ec2-instances-role"
    }

  # module.lambda_stop_ec2.aws_lambda_function.function will be created
  + resource "aws_lambda_function" "function" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Lambda function to stop EC2 instances outside working hours"
      + filename                       = "modules/lambda/lambda_function.zip"
      + function_name                  = "ec2-scheduler-stop-ec2-instances"
      + handler                        = "stop_instances.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.10"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "3vQdA+eeL4CGclL8z7HNZv7I6p9c44AeJQLlwzJ7Zqo="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCenter" = "IT"
          + "Owner"      = "Operations"
        }
      + tags_all                       = {
          + "CostCenter"  = "IT"
          + "CreatedBy"   = "EC2-Scheduler"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "Operations"
          + "Project"     = "ec2-scheduler"
        }
      + timeout                        = 60
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "REGION"    = "ap-south-1"
              + "TAG_KEY"   = "demo-key"
              + "TAG_VALUE" = "true"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

Plan: 16 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cloudwatch_start_rule_arn      = (known after apply)
  + cloudwatch_stop_rule_arn       = (known after apply)
  + lambda_start_ec2_function_arn  = (known after apply)
  + lambda_start_ec2_function_name = "ec2-scheduler-start-ec2-instances"
  + lambda_stop_ec2_function_arn   = (known after apply)
  + lambda_stop_ec2_function_name  = "ec2-scheduler-stop-ec2-instances"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @nag9844, Action: `pull_request`*